{
    "name": "سماح علي",
    "home": "الرئيسية",
    "about": "عنّي",
    "projects": "المشاريع",
    "skills": "المهارات",
    "contact": "اتصل بي",
    "language": "English",
    "hello": "مرحبًا، أنا",
    "intro_experience": "مهندسة برمجيات بخبرة تزيد عن 9 سنوات.",
    "hire_me": "لتوظيفي",
    "resume": "تحميل السيرة الذاتية",
    "about_me": "عنّي",
    "about_me_p_1": "أنا مطورة فول ستاك بخبرة تزيد عن 9 سنوات، أختص في بناء تطبيقات الويب التفاعلية وعالية الأداء. تشمل خبرتي تطوير الواجهة الأمامية باستخدام React، JavaScript، و HTML/CSS، وكذلك تطوير الواجهة الخلفية باستخدام Python (Django)، Node.js، وقواعد البيانات المختلفة (MongoDB، MySQL، MariaDB).",
    "about_me_p_2": "أنا ماهرة جدًا في تنفيذ الميزات القابلة للتوسع والفورية باستخدام WebSockets، Redis، و Celery لتنظيم المهام ومعالجة العمليات في الخلفية. بالإضافة إلى ذلك، أعطي الأولوية لتحسين محركات البحث وتعزيز الأداء لضمان أن تكون تطبيقاتي سريعة وصديقة لمحركات البحث. مع تركيز قوي على اختبارات الوحدة وأفضل الممارسات، ألتزم بتقديم شيفرة قابلة للصيانة وعالية الجودة.",
    "projects_worked": "المشاريع التي عملت عليها",
    "projects_c_title": "مشروع تطبيق الدفع بالعملات المشفرة",
    "projects_c_p_1": "تضمن هذا المشروع تطوير تطبيق دفع بالعملات المشفرة يسمح للمستخدمين بإجراء معاملات آمنة باستخدام العملات المشفرة. يتكامل النظام مع شبكات البلوكشين الرئيسية ويوفر ميزات مثل المدفوعات، والسحب، والتبديل. كما يدعم المشروع المراقبة الفورية للمعاملات على البلوكشين ويتضمن توليد رموز الاستجابة السريعة (QR) للمدفوعات.",
    "p_tech": "التقنيات المستخدمة:",
    "projects_c_django4": "Django 4.1",
    "projects_c_py3.11": "Python 3.11",
    "p_for_bck": "لتطوير الواجهة الخلفية",
    "projects_c_wb3": "Web3",
    "projects_c_for_eth": "للتكامل مع شبكة Ethereum",
    "projects_c_sol": "حزمة Solana",
    "projects_c_for_sol": "لتعامل مع معاملات شبكة Solana",
    "projects_c_dj_chnl": "Django Channels",
    "projects_c_for_web": "للتواصل الفوري عبر WebSocket",
    "projects_c_maria": "MariaDB",
    "p_for_db": "لإدارة قواعد البيانات",
    "projects_c_git": "Git",
    "projects_c_docker": "Docker",
    "projects_c_github": "GitLab",
    "projects_c_for_cicd": "لإدارة الإصدارات و CI/CD",
    "projects_c_sentry": "Sentry",
    "projects_c_for_sonar": "لتتبع الأخطاء و SonarQube لتحليل جودة الشيفرة",
    "projects_c_ngrok": "Ngrok",
    "projects_c_for_server": "لإنشاء نفق للخوادم المحلية",
    "projects_c_jira": "Jira",
    "projects_for_management": "لإدارة المشاريع",
    "p_c_role": "<strong>الدور:</strong><br> كنت مطورًا خلفيًا في هذا المشروع، مسؤولًا عن تصميم وتنفيذ الميزات الأساسية. قمت بدمج خدمات طرف ثالث مثل Fireblocks و Circle لإدارة العملات المشفرة بشكل آمن وبناء المكونات الأساسية مثل WebSocket الفوري لمراقبة معاملات البلوكشين. كما عملت على تنفيذ وظائف الدفع، والسحب، والتبديل. بالتعاون مع مطور البلوكشين، ضمنت التواصل السلس بين الواجهة الخلفية وشبكات البلوكشين (Ethereum و Solana).",
    "p_c_challenges": "<strong>التحديات والحلول:</strong><br> كان أحد التحديات الرئيسية هو دمج شبكات البلوكشين المتعددة (Ethereum و Solana) وضمان التواصل السلس بينها. استخدمت Web3 للتفاعل مع Ethereum وحزمة Solana لمعاملات Solana. لضمان المراقبة الفورية للمدفوعات، قمت بتنفيذ WebSocket غير متزامن باستخدام Django Channels، الذي تتبع حالة المعاملات وتعامل مع الفشل. بالإضافة إلى ذلك، تعاملت مع قضايا تتعلق بالتعامل مع الاستردادات وضمان استرداد المستخدمين بشكل صحيح عندما فشلت المعاملات.",
    "p_in_title": "منصة فحص العقارات",
    "p_in_p1": "منصة فحص العقارات هي تطبيق ويب مصمم لتبسيط فحص العقارات. تتيح المنصة للمستخدمين إدارة تفاصيل العقارات، وجدولة الفحوصات، وتوليد التقارير. كان دوري يركز على تطوير المكونات الرئيسية، ودمج خدمات الطرف الثالث، وضمان التشغيل السلس للتطبيق باستخدام مجموعة من التقنيات الحديثة.",
    "p_in_dj": "قوالب Django",
    "p_in_drf3": "DRF 3.1",
    "p_in_py3.9": "Python 3.9",
    "p_in_mysql": "MySQL",
    "p_in_for_git": "Git",
    "p_in_for_db": "Docker",
    "p_in_for_vc": "لإدارة الإصدارات والحاويات",
    "p_in_3rd_party": "التكامل مع خدمات الطرف الثالث:",
    "p_in_3rd_party_content": "خدمات الدفع من أمازون، Apple Pay، Qoyod، SendGrid، Bitly، Google Sheets (gspread)، Zapier",
    "p_in_3rd_party_cicd_tools": "أدوات المراقبة و CI/CD:",
    "p_in_3rd_party_cicd_tools_content": "Sentry، SonarQube، Slack، Ngrok، GitLab، Jira",
    "p_in_role": "<strong>الدور:</strong><br> عملت كمطور للواجهة الخلفية ودمج الخدمات، مسؤولًا عن إنشاء وإدارة مكونات الخادم ودمج خدمات الطرف الثالث. ساهمت في دمج بوابات الدفع (خدمات الدفع من أمازون، Apple Pay) وخدمات أخرى مثل Qoyod لإدارة الشؤون المالية، SendGrid للتواصل عبر البريد الإلكتروني، Bitly لاختصار الروابط، و Google Sheets باستخدام gspread للتقارير. بالإضافة إلى ذلك، عملت مع فريق الواجهة الأمامية Angular لضمان تكامل سلس بين النظامين.",
    "p_title_edu": "خدمة تعليمية: نظام الخاص بالقبول",
    "p_edu_p1": "ركز هذا المشروع على تطوير منصة تعليمية خاصة لإدارة قبول الطلاب، وتسجيل الدورات، والخدمات الأكاديمية الأخرى. يمكن للمؤسسات التعليمية من خلال النظام إدارة القبول، وتتبع تقدم الطلاب، ومعالجة المدفوعات والمواعيد.",
    "dj": "Django",
    "vue": "Vue/vuetify",
    "mysql": "MySQL",
    "git": "Git",
    "p_for_front": "لتطوير الواجهة الأمامية",
    "p_for_vc": "لإدارة الإصدارات",
    "redmine": "Redmine",
    "p_edu_role": "<strong>الدور:</strong><br> كنت جزءًا من فريق التطوير، مسؤولًا عن تنفيذ ميزات الواجهة الخلفية/الأمامية مثل تسجيل الطلاب، معالجة القبول، وقمت بدور Scrum Master في بعض السبرينتات.",
    "projects_sina_scrum_title": "الخدمة الطبية: نظام ابن سينا (Scrum Master)",
    "p_sina_scrum_p1": "بصفتي Scrum Master، كنت أسهل عملية تطوير التطبيقات ضمن نظام ابن سينا الطبي. شمل ذلك تخطيط السبرينت، الاجتماعات اليومية، مراجعات السبرينت، وضمان التزام الفريق بأساليب Agile.",
    "p_sina_scrum_p2": "<strong>الدور:</strong> كنت Scrum Master، أساعد الفريق في التزام المبادئ Agile. قمت بتسهيل تخطيط السبرينت، والمراجعات، وضمنت معالجة أي عوائق بسرعة. كما عملت عن كثب مع أصحاب المصلحة لضمان وضوح أهداف المشروع والجداول الزمنية للفريق.",
    "p_sina_scrum_p3": "<strong>التحديات والحلول:</strong> كان التحدي الرئيسي هو توافق فرق العمل المختلفة مع أصحاب المصلحة في إطار عملية Agile مع الحفاظ على تركيز المشروع على الأهداف. قمت بتسهيل المراجعات الدورية للتعرف على القضايا وضمان التحسين المستمر. كما عملت على معالجة نمو نطاق المشروع من خلال الحفاظ على قصص المستخدمين الواضحة في Redmine.",
    "projects_sina_lead_title": "الخدمة الطبية: نظام ابن سينا (قائد الفريق)",
    "p_sina_lead_p1": "نظام ابن سينا هو نظام شامل لإدارة الرعاية الصحية يقدم سجلات صحية إلكترونية (EHR)، جدولة المواعيد، الفوترة، وغيرها من خدمات الرعاية الصحية. كقائد فريق، كنت مسؤولًا عن الإشراف على تطوير ونشر الميزات الأساسية.",
    "p_sina_lead_p2": "<strong>الدور</strong><br> كقائد للفريق، كنت مسؤولًا عن تنسيق المهام، وتحديد مراحل المشروع، وضمان سير العمل بشكل صحيح. عملت عن كثب مع المطورين وأصحاب المصلحة لتصميم وتنفيذ الميزات الرئيسية، بما في ذلك إدارة المرضى، الجدولة، ووحدات الفوترة. بالإضافة إلى ذلك، قمت بمراجعة الشيفرة البرمجية وقدمّت الإرشاد الفني لأعضاء الفريق.",
    "p_sina_lead_p3": "<strong>التحديات والحلول:</strong><br> كان من التحديات إدارة الفرق المتعددة التي تعمل على وحدات مختلفة من النظام. ضمنت التواصل الواضح بين الفرق من خلال عقد اجتماعات يومية وتخطيط السبرينت.",
    "tech_skills": "المهارات التقنية",
    "skills_prog_lang": "لغات البرمجة:",
    "skills_py_dj": "Python (Django, DRF)",
    "skills_js_framework": "JavaScript (Angular, Vue2, React.js)",
    "skills_sql": "SQL (MySQL, PostgreSQL, MariaDB)",
    "skills_nosql": "NoSQL (MongoDB)",
    "web_dev": "تطوير الويب:",
    "web_front": "الواجهة الأمامية: Angular، Vue2، React.js، JavaScript، HTML5، CSS3",
    "web_back": "الواجهة الخلفية: Django 4.x، Django REST Framework (DRF 3.x)",
    "web_template": "محركات القوالب: قوالب Django",
    "web_real_time": "التواصل الفوري: WebSockets، Django Channels",
    "web_api_dev": "تطوير API: RESTful APIs، تكامل Web3، Solana Blockchain APIs",
    "web_auth_secure": "المصادقة والأمان: JWT، التشفير (تكاملات الدفع)",
    "tools": "DevOps والأدوات:",
    "tools_vc": "إدارة الإصدارات: Git، GitLab",
    "tools_docker": "الحاويات: Docker",
    "tools_cicd": "CI/CD: GitLab CI، Jenkins",
    "tools_cloud": "خدمات السحابة: AWS، Ngrok (الأنفاق المحلية)",
    "tools_monitor": "المراقبة والتسجيل: Sentry، SonarQube",
    "tools_project": "إدارة المشاريع والتعاون: Jira، Slack، Confluence",
    "tools_collaboration": "أدوات التعاون: GitLab، Slack، Jira، Teams",
    "third_party": "التكامل مع الأطراف الثالثة:",
    "third_party_payment": "بوابات الدفع: Amazon Payment Services، Apple Pay",
    "third_party_communication": "التواصل: SendGrid (البريد الإلكتروني)، Zapier (الأتمتة)",
    "third_party_link": "إدارة الروابط: Bitly",
    "third_party_google_sheet": "تكامل جداول Google: gspread API",
    "third_party_blockchain": "البلوكشين: Web3 (Ethereum)، Solana (معاملات البلوكشين)",
    "testing": "الاختبارات:",
    "testing_framework": "إطارات الاختبار: Pytest، اختبارات الوحدة، اختبارات التكامل",
    "testing_tools": "أدوات الاختبار: Postman (اختبار API)",
    "agile": "Agile و Scrum:",
    "agile_method": "المنهجيات Agile: Scrum، Kanban",
    "agile_scrum": "Scrum Master / قيادة الفريق: الاجتماعات اليومية، تخطيط السبرينت، المراجعات",
    "edu_cert": "التعليم والشهادات",
    "edu_cert_depi": "مسجل حاليًا: تطوير البرمجيات - مسار مطور واجهات الويب باستخدام React DEPI Program <br> 2024 – الحاضر",
    "edu_cert_depi_1": "اكتساب معرفة شاملة في HTML، CSS، JavaScript، والتخصص في React لتطوير الواجهات الأمامية للويب.",
    "edu_cert_depi_2": "اكتساب الكفاءة في Git/GitHub لإدارة الإصدارات، Node.js للبرمجة الجانبية للخادم، وأدوات الحاويات مثل Docker و Kubernetes.",
    "edu_cert_depi_3": "العمل على مشروع Capstone الذي يجمع بين React و Node.js لبناء تطبيق ويب حقيقي.",
    "edu_cert_iti": "دبلوم في التطوير المهني: تطوير الأنظمة، معهد تكنولوجيا المعلومات، وزارة الاتصالات وتكنولوجيا المعلومات <br> أكتوبر 2014 – يونيو 2015",
    "edu_cert_iti_project": "مشروع التخرج: \"OSHA\"",
    "edu_cert_iti_dt1": "دوري:",
    "edu_cert_iti_dt2": "تصميم مخطط علاقة الكيانات (ERD) لقاعدة البيانات.",
    "edu_cert_iti_dt3": "تطوير التطبيقات باستخدام HTML، jQuery، Bootstrap 3، C#، LINQ، ASP.Net، و SQL Server DB.",
    "edu_cert_mans": "بكالوريوس في تكنولوجيا المعلومات، كلية الحاسبات والمعلومات، جامعة المنصورة، مصر <br> سبتمبر 2010 – أغسطس 2014",
    "edu_cert_mans_dt1": "مشروع التخرج: \"الاستشعار والتحكم عن بعد عبر الشبكة\"",
    "edu_cert_mans_dt2": "دوري: تطوير حلول باستخدام MATLAB و OpenCV لاكتشاف الجلد.",
    "connect_me": "اتصل بي",
    "copyright": "حقوق الطبع والنشر © 2024 جميع الحقوق محفوظة | تم إنشاء قالب هذا الموقع من قبل سماح علي."
}