{
    "name": "Samah Ali",
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "skills": "Skills",
    "contact": "Contact Me",
    "language": "العربية",
    "hello": "Hello, I'm",
    "intro_experience": "A Software Engineer with 9+ years of Experience.",
    "hire_me": "Hire Me",
    "resume": "Get Resume",
    "about_me": "About Me",
    "about_me_p_1": "I am a full-stack developer with 9+ years of experience specializing in building responsive, high-performance web applications. My expertise includes front-end development with React, JavaScript, and HTML/CSS, as well as back-end development with Python (Django), Node.js, and various databases (MongoDB, MySQL, MariaDB).",
    "about_me_p_2":"I am highly proficient in implementing scalable, real-time features using WebSockets, Redis, and Celery for task queuing and background processing. Additionally, I prioritize SEO optimization and performance enhancements to ensure my applications are fast and search engine-friendly. With a strong focus on unit testing and best practices, I am dedicated to delivering maintainable and high-quality code.",
    "projects_worked": "Projects I worked on it",
    "projects_c_title": "Crypto Payment Application Project",
    "projects_c_p_1": "This project involved developing a crypto payment application that allows users to make secure transactions using cryptocurrencies. The system integrates with major blockchain networks and provides features like payments, withdrawals, and swaps. The project also supports real-time monitoring of blockchain transactions and integrates QR code generation for payments.",
    "p_tech": "Technologies Used:",
    "projects_c_django4": "Django 4.1",
    "projects_c_py3.11": "Python 3.11",
    "p_for_bck": "for backend development",
    "projects_c_wb3": "Web3",
    "projects_c_for_eth": "for Ethereum blockchain integration",
    "projects_c_sol": "Solana package",
    "projects_c_for_sol": "for handling Solana blockchain transactions",
    "projects_c_dj_chnl": "Django Channels",
    "projects_c_for_web": "for real-time WebSocket communication",
    "projects_c_maria": "MariaDB",
    "p_for_db": "for database management",
    "projects_c_git": "Git",
    "projects_c_docker": "Docker",
    "projects_c_github": "GitLab",
    "projects_c_for_cicd": "for version control and CI/CD",
    "projects_c_sentry": "Sentry",
    "projects_c_for_sonar": "for error tracking, SonarQube for code quality analysis",
    "projects_c_ngrok": "Ngrok",
    "projects_c_for_server": "for local server tunneling",
    "projects_c_jira": "Jira",
    "projects_for_management": " for project management",
    "p_c_role": "<strong>Role:</strong> <br> I served as the backend developer for this project, responsible for designing and implementing the core features. I integrated third-party services such as Fireblocks and Circle for secure cryptocurrency management and built critical components like the real-time WebSocket to monitor blockchain transactions. I also worked on implementing the payment, withdrawal, and swap functionalities. In collaboration with the blockchain developer, I ensured smooth communication between the backend and blockchain networks (Ethereum and Solana).",
    "p_c_challenges": "<strong>Challenges and Solutions:</strong><br> One of the main challenges was integrating multiple blockchain networks (Ethereum and Solana) and ensuring seamless communication between them. I used Web3 to interact with Ethereum and the Solana package for Solana transactions. To ensure real-time monitoring of payments, I implemented an asynchronous WebSocket using Django Channels, which tracked transaction status and handled failures. Additionally, I dealt with issues related to handling refunds, ensuring users were refunded correctly when transactions failed.",
    "p_in_title": "Property Inspection Platform",
    "p_in_p1": "The Property Inspection Platform is a web application designed to streamline property inspections. The platform allows users to manage property details, schedule inspections, and generate reports. My role focused on developing key components, integrating third-party services, and ensuring the smooth operation of the application using a variety of modern technologies.",
    "p_in_dj": "Django Templates",
    "p_in_drf3": "DRF 3.1",
    "p_in_py3.9": "Python 3.9",
    "p_in_mysql": "MySQL",
    "p_in_for_git": "Git",
    "p_in_for_db": "Docker",
    "p_in_for_vc": "for version control and containerization",
    "p_in_3rd_party": "Third-party integrations:",
    "p_in_3rd_party_content": "Amazon Payment Services, Apple Pay, Qoyod, SendGrid, Bitly, Google Sheets (gspread), Zapier",
    "p_in_3rd_party_cicd_tools": "Monitoring and CI/CD tools:",
    "p_in_3rd_party_cicd_tools_content": "Sentry, SonarQube, Slack, Ngrok, GitLab, Jira",
    "p_in_role": "<strong>Role:</strong><br> I worked as a backend and integration developer, responsible for creating and managing the server-side components and integrating various third-party services. I contributed to the integration of payment gateways (Amazon Payment Services, Apple Pay) and other services like Qoyod for financial management, SendGrid for email communication, Bitly for link shortening, and Google Sheets using gspread for reporting. Additionally, I worked with the Angular front-end team to ensure seamless integration between front-end and back-end systems.",
    "p_title_edu": "Educational Service: Private & Admission System",
    "p_edu_p1": "This project focused on developing a private educational service platform for managing student admissions, course registration, and other academic services. The system enables educational institutions to manage admissions, track student progress, and process payment and scheduling.",
    "dj": "Django",
    "vue": "Vue/vuetify",
    "mysql": "MySQL",
    "git": "Git",
    "p_for_vc": "for version control",
    "redmine": "Redmine",
    "p_edu_role": "<strong>Role:</strong><br>I was part of the development team, responsible for implementing the backend/frontend features such as student registration, admission processing. act as srum master in some sprints",
    "projects_sina_scrum_title": "Medical Service: Ibn-Sina System (Scrum Master)",
    "p_sina_scrum_p1": "As Scrum Master, I facilitated the agile development process for various applications within the Ibn-Sina medical system. This included sprint planning, daily stand-ups, sprint reviews, and ensuring the team adhered to agile methodologies.",
    "p_sina_scrum_p2": "<strong>Role</strong>I served as Scrum Master, helping the development team stay aligned with agile principles. I facilitated sprint planning, retrospectives, and ensured any blockers were swiftly addressed. I also worked closely with stakeholders to ensure the project goals and timelines were clearly communicated to the team.",
    "p_sina_scrum_p3": "<strong>Challenges and Solutions:</strong> The main challenge was aligning various teams and stakeholders with the agile process while maintaining focus on project goals. I facilitated regular retrospectives to identify issues and ensure continuous improvement. I also worked to address scope creep by maintaining clear and concise user stories in Redmine.",
    "projects_sina_lead_title": "Medical Service: Ibn-Sina System (Team Leader)",
    "p_sina_lead_p1": "The Ibn-Sina System is a comprehensive medical management system that provides electronic health records (EHR), appointment scheduling, billing, and other healthcare services. As a team leader, I was responsible for overseeing the development and deployment of core features.",
    "p_sina_lead_p2": "<strong>Role</strong><br> As the team leader, I coordinated tasks, set project milestones, and ensured that development was on track. I worked closely with both developers and stakeholders to design and implement key features, including patient management, scheduling, and billing modules. Additionally, I conducted code reviews and provided technical mentorship to team members.",
    "p_sina_lead_p3": "<strong>Challenges and Solutions:</strong><br> Managing multiple teams working on different modules of the system was a challenge. I ensured clear communication between teams by holding daily stand-ups and sprint planning meetings.",
    "tech_skills": "Technical Skills",
    "skills_prog_lang": "Programming Languages:",
    "skills_py_dj": "Python (Django, DRF)",
    "skills_js_framework": "JavaScript (Angular, Vue2, React.js)",
    "skills_sql": "SQL (MySQL, PostgreSQL, MariaDB)",
    "skills_nosql": "NoSQL(MongoDB)",
    "web_dev": "Web Development:",
    "web_front": "Frontend: Angular, Vue2, React.js, JavaScript, HTML5, CSS3",
    "web_back": "Backend: Django 4.x, Django REST Framework (DRF 3.x)",
    "web_template": "Template Engines: Django Templates",
    "web_real_time": "Real-time Communication: WebSockets, Django Channels",
    "web_api_dev": "API Development: RESTful APIs, Web3 Integration, Solana Blockchain APIs",
    "web_auth_secure": "Authentication & Security:JWT, Encryption (Payment Integrations)",
    "tools": "DevOps & Tools:",
    "tools_vc": "Version Control: Git, GitLab",
    "tools_docker": "Containerization: Docker",
    "tools_cicd": "CI/CD: GitLab CI, Jenkins",
    "tools_cloud": "Cloud Services: AWS, Ngrok (Local Tunneling)",
    "tools_monitor": "Monitoring & Logging: Sentry, SonarQube",
    "tools_project": "Project Management & Collaboration: Jira, Slack, Confluence",
    "tools_collaboration": "Collaboration Tools: GitLab, Slack, Jira, Teams",
    "third_party": "Third-Party Integrations:",
    "third_party_payment": "Payment Gateways: Amazon Payment Services, Apple Pay",
    "third_party_communication": "Communication: SendGrid (Email), Zapier (Automation)",
    "third_party_link": "Link Management: Bitly",
    "third_party_google_sheet": "Google Sheets Integration: gspread API",
    "third_party_blockchain": "Blockchain: Web3 (Ethereum), Solana (Blockchain Transactions)",
    "testing": "Testing:",
    "testing_framework": "Testing Frameworks: Pytest, Unit Testing, Integration Testing",
    "testing_tools": "Test Tools: Postman (API Testing)",
    "agile": "Agile & Scrum:",
    "agile_method": "Agile Methodologies: Scrum, Kanban",
    "agile_scrum": "Scrum Master/Team Leadership: Daily Standups, Sprint Planning, Retrospectives",
    "edu_cert": "Education and Certificates",
    "edu_cert_depi": "Currently Enrolled: Software Development - React Frontend Web Developer Track DEPI Program <br>2024 – Present",
    "edu_cert_depi_1":"Acquiring comprehensive knowledge in HTML, CSS, JavaScript, and specializing in React for frontend web development.",
    "edu_cert_depi_2":"Gaining proficiency in Git/GitHub for version control, Node.js for server-side scripting, and containerization tools like Docker and Kubernetes.",
    "edu_cert_depi_3":"Working on a Capstone Project that combines React and Node.js to build a real-world web application.",
    "edu_cert_iti": "Diploma in Professional Development: System Development,<br> Information Technology Institute, Ministry of Communications and Information Technology <br> Oct 2014 – Jun 2015",
    "edu_cert_iti_project": "Graduation Project: \"OSHA\"",
    "edu_cert_iti_dt1": "My Role:",
    "edu_cert_iti_dt2": "Designed the Entity Relationship Diagram (ERD) for the database.",
    "edu_cert_iti_dt3": "Developed applications using HTML, jQuery, Bootstrap 3, C#, LINQ, ASP.Net, and SQL Server DB.",
    "edu_cert_mans": "Bachelor’s of Computer Science and Information Technology Faculty of Computers and Information, Mansoura University, Egypt <br> Sep 2010 – Aug 2014 ",
    "edu_cert_mans_dt1": "Graduation Project: \"Remote Sensing and Control via Network\"",
    "edu_cert_mans_dt2": "My Role: Developed solutions using MATLAB and OpenCV for Skin Detection.",
    "connect_me": "Contact Me",
    "copyright": "Copyright © 2024 All rights reserved | This portfolio website template is created by Samah Ali."

}